tweeter_app_api/app/controllers/replies_controller.rb

SELECT "replies".* FROM "replies"
---
  def index
    replies = Reply.all