tweeter_app_api/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    puts "show route: params #{params}"
    tweet = Tweet.find(params[:id])

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "author" = $1 WHERE "tweets"."id" = $2  [["author", "dipset"], ["id", 3]]
---
  def update
    tweet = Tweet.find(params[:id])
    tweet.update(tweet_params)